handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_adc.c
}
/**
*\*\name    ADC_EnableInternalInputBuffer.
*\*\fun     Enable and disable ADC internal input buffer.
*\*\param   Cmd : new state of the ADC peripheral.
*\*\          -ENABLE 
*\*\          -DISABLE
*\*\return  none
**/
void ADC_EnableInternalInputBuffer(FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the ADC internal reference voltage */
        ADC->CTRL3 |= ADC_IN_BUFFER_ENABLE;
    }
    else
    {
        /* Disable the ADC internal reference voltage */
        ADC->CTRL3 &= (~ADC_IN_BUFFER_ENABLE);
    }
}


/**
*\*\name    ADC_Temp_Sensor_Enable.
*\*\fun     Enable and disable temperature sensor channel .
*\*\param   Cmd : new state of the ADC peripheral.
*\*\          -ENABLE 
*\*\          -DISABLE
*\*\return  none
**/
void ADC_EnableTempSensor(FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Temperature sensor channel enabled */
        ADC->CTRL2 |= ADC_CTRL2_TEMPEN;
    }
    else
    {
        /* Temperature sensor channel disable */
        ADC->CTRL2 &= (~ADC_CTRL2_TEMPEN);
    }
}

/**
*\*\name    ADC_EnableVREFPAsReferenceVoltag.
*\*\fun     Select VREF+ as ADC reference voltage source or not.
*\*\param   Cmd : new state of the ADC peripheral.
*\*\          -ENABLE 
*\*\          -DISABLE
*\*\return  none
**/
void ADC_EnableVREFPAsReferenceVoltag(FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Select VREF+ as ADC reference voltage source */
        ADC->CTRL1 |= ADC_REF_SEL_VREF;
    }
    else
    {
        /* Select VDDA as ADC reference voltage source */
        ADC->CTRL1 &= (~ADC_REF_SEL_VREF);
    }
}

/**
*\*\name    ADC_Clock_Mode_Config
*\*\fun     Configures the ADCHCLK prescaler.
*\*\param   ADC_clkmode:
*\*\          - ADC_CKMOD_AHB
*\*\          - ADC_CKMOD_PLL
*\*\          - ADC_CKMOD_HSI
*\*\param   RCC_ADCHCLKprescaler:
*\*\          - RCC_ADCHCLK_DIV1 
*\*\          - RCC_ADCHCLK_DIV2 
*\*\          - RCC_ADCHCLK_DIV4 
*\*\          - RCC_ADCHCLK_DIV6 
*\*\          - RCC_ADCHCLK_DIV8 
*\*\          - RCC_ADCHCLK_DIV10 
*\*\          - RCC_ADCHCLK_DIV12 
*\*\          - RCC_ADCHCLK_DIV16 
*\*\          - RCC_ADCHCLK_DIV32

*\*\          - RCC_ADCPLLCLK_DIV1 
*\*\          - RCC_ADCPLLCLK_DIV2 
*\*\          - RCC_ADCPLLCLK_DIV4 
*\*\          - RCC_ADCPLLCLK_DIV6 
*\*\          - RCC_ADCPLLCLK_DIV8
*\*\          - RCC_ADCPLLCLK_DIV10
*\*\          - RCC_ADCPLLCLK_DIV12 
*\*\          - RCC_ADCPLLCLK_DIV16 
*\*\          - RCC_ADCPLLCLK_DIV32 
*\*\          - RCC_ADCPLLCLK_DIV64 
*\*\          - RCC_ADCPLLCLK_DIV128 
*\*\          - RCC_ADCPLLCLK_DIV256 
*\*\return  none
**/
void ADC_ClockModeConfig(ADC_CKMOD ADC_clkmode, uint32_t RCC_ADCHCLKprescaler)
{
    if(ADC_clkmode == ADC_CKMOD_AHB)
    {
        RCC_ConfigADCClksrc(RCC_ADC_CLKSRC_HCLK);
        RCC_ConfigAdcHclk(RCC_ADCHCLKprescaler);
    }
    else if(ADC_clkmode == ADC_CKMOD_PLL)
    {
        RCC_ConfigADCClksrc(RCC_ADC_CLKSRC_PLL);
        RCC_ConfigAdcPllClk(RCC_ADCHCLKprescaler,ENABLE);
    }
    else if(ADC_clkmode == ADC_CKMOD_HSI)
    {
        RCC_ConfigADCClksrc(RCC_ADC_CLKSRC_HSI24M);
    }
    else
    {
        /* no process */
    }
}
/**
*\*\name  Delay_8ADC_Colck.
*\*\fun   Delay 8 ADC_CLK according to the system clock and adc clock.
*\*\param SysClk ,the system clcok frequency.
*\*\param adc_clkk ,the adc operating clcok frequency.
*\*\note: this function is not very precise, if you want to get more precise delay time, please modify this function directly. 
*\*\return  None
 */
static void Delay_8ADC_Colck(uint32_t SysClk, uint32_t adc_clk)
{
    uint16_t Count = 0;
    __IO uint16_t  div = 0;
    div =  (SysClk/adc_clk);
    if(div <= 64)
    {
        div = 1;
    }
    else if(div <= 128)
    {
        div = 25;
    }
    else if(div <= 256)
    {
        div = 70;
    }
    while(Count < div)  
    {
        __NOP();
        Count++;
    }
}

